Tekla.Structures.ModelInternal.Operation
Internal operations

Tekla.Structures.ModelInternal.Operation.OperationsMaxMessageLength
The operations max message length.

Tekla.Structures.ModelInternal.Operation.ERROR_INSUFFICIENT_BUFFER
"The data area passed to a system call is too small" system error.

Tekla.Structures.ModelInternal.Operation.RemotePrintingController
Gets or sets the remote printing controller.

Tekla.Structures.ModelInternal.Operation.ImportExternalReferenceModel(System.String,System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.String,System.String,System.String)
Imports external reference model.
fileAndPath: Full file name and path.
basePointGuid: The base point guid. Leave empty for location by model origin. Use 49C25886-7FA7-4F2E-84E1-84ED231A22B5 for auto-created base point.
origin: The origin.
axisX: The axis X.
axisY: The axis Y.
scale: The scale.
tcModelId: The Trimble Connect model unique id. If left empty, default empty string will be used.
tcModelVersionId: The Trimble Connect model version id. If left empty, default empty string will be used.
tCModelName: The Trimble Connect model name . If left empty, default empty string will be used.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.ImportOverlayModelWithMetadata(System.String,System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.String,System.String,System.String)
Imports external reference model.
fileAndPath: Full file name and path.
basePointGuid: The base point guid. Leave empty for location by model origin. Use 49C25886-7FA7-4F2E-84E1-84ED231A22B5 for auto-created base point.
origin: The origin.
axisX: The axis X.
axisY: The axis Y.
scale: The scale.
tcModelId: The Trimble Connect model unique id. If left empty, default empty string will be used.
tcModelVersionId: The Trimble Connect model version id. If left empty, default empty string will be used.
tCModelName: The Trimble Connect model name . If left empty, default empty string will be used.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.UpdateOverlayModel(System.String,System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.String)
Imports external reference model.
fileAndPath: Full file name and path.
basePointGuid: The base point guid. Leave empty for location by model origin. Use 49C25886-7FA7-4F2E-84E1-84ED231A22B5 for auto-created base point.
origin: The origin.
axisX: The axis X.
axisY: The axis Y.
scale: The scale.
tcModelVersionId: The Trimble Connect model version id. If left empty, default empty string will be used.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.GetOverlayModel(System.String)
Gets the overlay model information.
Returns: The overlay model information if available, otherwise null.

Tekla.Structures.ModelInternal.Operation.GetImportedExternalReferenceModels
Gets the paths of the imported external reference models. The paths match with the paths
given when model was imported using ImportExternalReferenceModel().
Returns: The currently imported external reference models paths.

Tekla.Structures.ModelInternal.Operation.RemoveExternalReferenceModels(System.Collections.Generic.IEnumerable{System.String})
Removes the given external reference models defined by the given full file names and paths.
paths: The full file names and paths.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.ShowExternalReferenceModels(System.Collections.Generic.IEnumerable{System.String},System.Boolean)
Sets the given external reference models visible.
paths: The full file names and paths.
restrictToWorkArea: Boolean indicating whether the drawing shoudl be retricted to work area only.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.HideExternalReferenceModels(System.Collections.Generic.IEnumerable{System.String})
Sets the given external reference models hidden.
paths: The full file names and paths.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.SetExternalReferenceModelObjectVisibilities(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)
Sets the given external reference model objects visibilities. For all objects, give null/empty container.
path: The full file name and path of the model.
objectGuids: The object guids to be hidden. If null/empty container given, all objects are affected.
isVisible: True for visible, false for hidden.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.SelectObjectsInExternalReferenceModel(System.String,System.Collections.Generic.IEnumerable{System.String})
Selects the given objects in the external reference model
path: The full file name and the path to the model
objectGuids: The object guids to be selected in the model
Returns: True if the selection was successful and false otherwise

Tekla.Structures.ModelInternal.Operation.ZoomToExternalReferenceModel(System.String)
Zooms to the external reference models area.
path: The full file name and path.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.ZoomViewToExternalReferenceModel(System.String,Tekla.Structures.Model.UI.View)
Zooms a view to the external reference models area.
path: The full file name and path.
view: The view to zoom.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.SetViewVisibilityFilterValue(System.Int32,System.String)
Sets the model view visibility filter value.
viewId: The temporary model view Id.
viewVisibilityFilterValue: The view visibility filter value.
Returns: True if the model view visibility filter was succesfully set.

Tekla.Structures.ModelInternal.Operation.GetModelViewVisibilityFilterValue(System.Int32,System.String@)
Gets the model view visibility filter value.
modelViewId: The model view id.
modelViewVisibilityFilterValue: The model view visibility filter value.
Returns: True if the model view visibility filter value was succesfully returned.

Tekla.Structures.ModelInternal.Operation.SetSelectedExternalReferenceModel(System.String)
Set external reference model as selected in model views.
path: The full file name and path.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelLayers(System.String)
Get external reference model layers.
path: The full file name and path of the external reference model.
Returns: The layers.

Tekla.Structures.ModelInternal.Operation.SetExternalReferenceModelLayerVisibilities(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.ModelInternal.dotExternalReferenceModelLayer_t})
Sets the external reference model layer visibilities.
path: The full file name and path of the external reference model.
layers: The layers with new visibilities.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.Operation.SetExternalReferenceModelLayerVisibility(System.String,System.Int32,Tekla.Structures.Model.ReferenceModel.VisibilityEnum)
Sets the external reference model layers visibility.
path: The full file name and path of the external reference model.
index: The layer index, which visibility is changed.
visibility:  The new visibility.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.Operation.SetExternalReferenceModelObjectColoring(System.String,System.Collections.Generic.IEnumerable{System.String},System.Double,System.Double,System.Double,System.Double)
Sets the given external reference models objects coloring. For all objects, give null/empty container.
path: The models path.
objectGuids: The object guids to be colored. If null/empty container given, all objects are affected.
red: The red value between 0-255.
green: The green value between 0-255.
blue: The blue value between 0-255.
alpha: The alpha value between 0-255.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.ResetExternalReferenceModelColoring(System.String,System.Collections.Generic.IEnumerable{System.String})
Resets the given external reference models objects coloring back to default.
path: The models path.
objectGuids: The Objects to reset, empty list to reset all.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.StartExternalReferenceModelChangeDetection(System.String,System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.String,System.String)
Starts the external reference model change detection between the given TrimBim file paths.
NOTE: The current version needs to be imported first using ImportExternalReferenceModel()
before executing change detection.
currentVersion: The full file name and path of the current version.
newVersion: The full file name and path of the new version.
changed: Include changed entities.
inserted: Include inserted entities.
deleted: Include deleted entities.
unchanged: Include unchanged entities.
comparisonSetTitle: The title of the comparison set to be used. If left empty, default will be used.
tolerancesTitle: The title of the tolerances item to be used. If left empty, default will be used.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.Operation.StopExternalReferenceModelChangeDetection
Stops any external reference model change detection operation.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelSelections
Gets the external reference model selections.
Returns: The external reference model selections.

Tekla.Structures.ModelInternal.Operation.GetOverlayModelSelectedEntityGuids(System.String)
Gets the external reference model selections.
path: The path to the overlay/external reference model
Returns: The external reference model selections.

Tekla.Structures.ModelInternal.Operation.GetRunTimeIdentifiersByGuid(System.Collections.Generic.List{System.String})
Gets the corresponding run time identifiers to list of guids in a mass operation.
guids: List of guids to convert
Returns: the list of

Tekla.Structures.ModelInternal.Operation.GetHiddenExternalObjects
Gets the hidden objects of the external reference models.
Returns:

Tekla.Structures.ModelInternal.Operation.GetOverlayModelHiddenEntityGuids(System.String)
Gets the external reference model hidden entities.
path: The path to the overlay/external reference model
Returns: The external reference model hidden entities.

Tekla.Structures.ModelInternal.Operation.ConvertStringListToExternalReferenceModelSelectionList
Converts the current string list to external reference model selection list.
Returns:

Tekla.Structures.ModelInternal.Operation.SelectObjectsFromModel(System.Collections.Generic.IEnumerable{System.String},System.Boolean)
Selects the given objects from model. Also zooms to those objects, if boolean
set to true.
guids: The guids of the objects to be selected.
zoomTo: True, if objects should be also zoomed to.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.LaunchExternalReferenceModelComparisonTolerancesDialog
Launches the comparison tolerances dialog.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.LaunchExternalReferenceModelComparisonSetsDialog
Launches the comparison sets dialog.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelComparisonTolerances
Gets the available comparison tolerance items titles.
Returns: The titles of the available tolerance items.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelComparisonSets
Gets the available comparison sets titles.
Returns: The titles of the available comparison sets.

Tekla.Structures.ModelInternal.Operation.ChangeDetectionInitInProgress
Checks if change detection initialization is still in progress.
Returns: True if still in progress.

Tekla.Structures.ModelInternal.Operation.CancelChangeDetectionInit
Cancels the change detection initialization, if in progress.
Returns: True if cancellation request successful. False, if there was nothing to cancel.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelPath(System.String)
Gets the external reference models path.
modelTsGuid: The models TS generated guid, which path is to be retrieved.
Returns: The models path, if found.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelEntitiesCount(System.String)
Get external reference model entities count.
path: The full file name and path.
Returns: Entities count.

Tekla.Structures.ModelInternal.Operation.ConvertTsGuidToIfcGuid(System.String)
Converts the given TS guid (long) to IFC guid (short).
tsGuid: The TS guid.
Returns: The IFC guid.

Tekla.Structures.ModelInternal.Operation.ConvertIfcGuidToTsGuid(System.String)
Converts the given IFC guid (short) to TS guid (long).
ifcGuid: The IFC guid.
Returns: The IFC guid.

Tekla.Structures.ModelInternal.Operation.GetOverlayModelEntityIdsFromIfcGuids(System.String,System.Collections.Generic.List{System.String})
Retrieves the runtime ids corresponding to the provided list of GUIDs for the specified overlay model.
path: The path to the overlay model
guids: The list of GUIDs
Returns: The list of ids

Tekla.Structures.ModelInternal.Operation.GetOverlayModelEntitiesIfcGuidsFromIds(System.String,System.Collections.Generic.List{System.Int32})
Retrieves the GUIDs corresponding to the provided list of runtime ids for the specified overlay model.
path: The path to the overlay model
ids: The list of runtime ids
Returns: The list of GUIDs

Tekla.Structures.ModelInternal.Operation.GetReferenceModelObjectAttributes(System.Int32)
Gets the reference model object attributes.
refererenceModelObjectId: The reference model object id.
Returns: The attributes.

Tekla.Structures.ModelInternal.Operation.GetHiddenObjects
Retrieves a list of hidden objects in the model.
Returns: A list of object IDs representing the hidden objects.

Tekla.Structures.ModelInternal.Operation.ClearTemporaryColor(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Clears temporary color from model objects and keeps the transparency as before.
Returns: True if succesful

Tekla.Structures.ModelInternal.Operation.DeleteClipPlanes(Tekla.Structures.Model.UI.View,System.Collections.Generic.List{System.Int32})
Removes all clip planes in the array.
view: The view where the clip planes are removed.
sectionPlaneIds: Ids of the clip planes.

Tekla.Structures.ModelInternal.Operation.SetViewPartRepresentationState(Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum)
Sets The representation state of the current view for parts

Tekla.Structures.ModelInternal.Operation.GetOverlayModelTCIdAndVersionId(System.String)
Gets the Trimble Connect model identifier and version identifier from the overlay model path.
path: The path of the imported overlay model
Returns: The TC model id and version id

Tekla.Structures.ModelInternal.Operation.ExportIFCFromAll(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Collections.Generic.IEnumerable{System.String},System.Boolean,System.Boolean,System.String)
IFC export from all objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
AttributeOverrides:  List of attribute overrides to be used in export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.TqlExecute(System.String,System.String@)
TQL execute.
TqlQuery:  The TQL query
TqlResult:  The string result
Returns: string, containing the selected ids

Tekla.Structures.ModelInternal.Operation.ImportSemantic(System.String,System.String,System.Collections.Generic.List{System.Int32}@,Tekla.Structures.ModelInternal.dotSemanticConversionSettings_t@,System.Double,System.Double,System.Double)
Import semantic file. Creates native objects to TS model based on the file.
FileNameAndPath:  The semantic file name and path.
BasePointGuid: The base point guid if base point used, otherwise empty string.
ConvertedObjects: The result object ids from conversion.
///
Settings: The settings for importing Semantic.
OffsetX: x-offset
OffsetY: y-offset
OffsetZ: z-offset
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.ExportModel(System.String,System.String,System.String,System.String,System.String,System.String,System.Boolean,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t,System.Action{System.String,System.Int32})
Exports TS model to file.
outPath: Output file name and path.
basePointType: The base point type.
basePointGuid:
basePointExportType:
exportType:
propertiesPath:
selectedOnly:
info:
progressCb:
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.ExportModelSemanticDb(System.String,System.String,System.String)
Given a local path to a .trb (TrimBim) file and a local path to a .seb (Semantic TrimBim) file,
exports a .sdb (SemanticDb, i.e. lumo file with trimbim + semantic schema) file to the given output path.
trimBimFilePath: The path to the local trimBim file
semanticFilePath: The path to the local semantic file
outputFilePath: The path for the generated local lumo file
Returns: true if the export was successful; false otherwise

Tekla.Structures.ModelInternal.Operation.ExportModelSemanticDb(System.String,System.String,System.String,System.String,System.Boolean,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t)
Exports TS model to file.
outPath: Output file name and path.
basePointGuid:
basePointExportType:
propertiesPath:
selectedOnly:
info:
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.ConvertReferenceModels(Tekla.Structures.ModelInternal.dotSemanticConversionSettings_t)
Converts Reference models as TS native objects.

Tekla.Structures.ModelInternal.Operation.CreateExportObjectList(System.String,System.Boolean,Tekla.Structures.ModelInternal.dotExportSelectionInfo_t)
Converts Create only object list instead of full export.

Tekla.Structures.ModelInternal.Operation.SemanticTestAgainstModel(System.String,System.String,System.Boolean)
Converts Test Semantic model against native model.

Tekla.Structures.ModelInternal.Operation.ExportIFCFromSelected(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.ModelInternal.Operation.IfcExportType,System.Boolean,System.Boolean,System.String)
IFC export from selected objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
AttributeOverrides: The attribute overrides file names and paths.
exportType: The IFC export type.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromObjects(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.ModelInternal.Operation.IfcExportType,System.Boolean,System.Boolean,System.String)
IFC export from given objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ModelObjects:  List of model objects to export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
AttributeOverrides: The attribute overrides file names and paths.
exportType: The IFC export type.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromFilteredObjects(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.ModelInternal.Operation.IfcExportType,System.Boolean,System.Boolean,System.String)
IFC export from filtered objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
FilterName:  Filter file name for model objects to export.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
AttributeOverrides: The attribute overrides file names and paths.
exportType: The IFC export type.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.GetMEPIFCExport
Get MEP IFC export component name

Tekla.Structures.ModelInternal.Operation.ExportMEPIFC(System.String,System.String,Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,System.Boolean,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.String)
MEP IFC export
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
FilterName:  Filter file name for model objects to export.
FromSelected:  Use selected model objects to export.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines color settings for objects in export.
Flags: Boolean flags for IFC 4 export.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ConvertIFC4toSemantic(System.String,System.String)
Converts IFC4 to Semantic TrimBIM.
ifc4File:  The ifc4 file to convert to sematnci tribmim.
outputPath: The output path.
Returns:
Returns false if successful.

Tekla.Structures.ModelInternal.Operation.ExportDgnFromAll(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dgn export from all objects.
FileName:  The file name.
Folder:  The folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export.
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportDgnFromSelected(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dgn export from selected objects.
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.ExportDwgFromAll(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dwg export from all objects.
FileName:  The file name.
Folder:  The folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportDwgFromSelected(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dwg export from selected objects.
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.ExportRevitFromAll(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)
Revit export from all objects.
FileName:  The name of the rvt export file.
Folder:  The export folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
UpdateSelected: Update the existing file
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportRevitFromSelected(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)
Revit export from selected objects.
FileName:  The name of the export rvt file.
Folder:  The export folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
UpdateSelected: Update the existing file
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.HandlePdfReport(System.String)
Handle Pdf Report.
ReportPath: The report path.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.GetPropertySetDialogFeature


Tekla.Structures.ModelInternal.Operation.SetPropertySetDialogFeature(Tekla.Structures.ModelInternal.IPropertySetDialogFeature)


Tekla.Structures.ModelInternal.Operation.ExportIFC(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.ModelInternal.Operation.IfcExportType,System.Boolean,System.Boolean,System.String)


Tekla.Structures.ModelInternal.Operation.GetViewTypeAsInt(Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum)


Tekla.Structures.ModelInternal.Operation.DoExportDgn(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.DoExportDwg(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.DoExportRevit(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.Boolean,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.SetTestSavePoint


Tekla.Structures.ModelInternal.Operation.RollbackToTestSavePoint


Tekla.Structures.ModelInternal.Operation.RollbackToTestSavePoint(System.Boolean)


Tekla.Structures.ModelInternal.Operation.Select(System.Collections.ArrayList,System.Boolean,System.Boolean)
Selects a list of objects from the user interface.
ModelObjects: The list of model objects to select.
ShowDimensions: Defines whether to show dimensions of the parts in the selection.
SuppressCallbacks: if set to true, suppress callbacks.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.DeleteMacro(System.String,Tekla.Structures.ModelInternal.Operation.MacroLocationEnum)
Delete the specified macro and associated files
fileName:
The file name. fileName is relative to either the XS_MACRO_DIRECTORY global or local directories or is the absolute
path to the macro .cs file
macroLocation:
The macro Location enumeration.
Returns:
Returns false if the .cs file does not exist or cannot be deleted

Tekla.Structures.ModelInternal.Operation.Interrupt


Tekla.Structures.ModelInternal.Operation.dotStartCommand(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotStartAction(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSaveModel(System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSaveAsModel(System.String,System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotAutoSaveModel(System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotQuitProgram(System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotUndo


Tekla.Structures.ModelInternal.Operation.dotRedo


Tekla.Structures.ModelInternal.Operation.dotClearUndoLog


Tekla.Structures.ModelInternal.Operation.GetLatestUndoLogInfo
Gets the latest info messsage from undo log
Returns:
Returns latest info message and the direction from the undo log

Tekla.Structures.ModelInternal.Operation.GetCurrentUndoLogInfo
Gets the current info messsage from undo log
Returns:
Returns current info message and the direction from the undo log

Tekla.Structures.ModelInternal.Operation.dotBhMoveObjects(Tekla.Structures.Geometry3d.Point,System.Collections.Generic.IList{System.Int32})


Tekla.Structures.ModelInternal.Operation.dotGetDataBaseVersionInfoFromModel(System.String,System.String,System.Int32@,System.Int32@)


Tekla.Structures.ModelInternal.Operation.dotGetDatabaseVersion


Tekla.Structures.ModelInternal.Operation.dotRunDataRetrieverCommand(System.String)


Tekla.Structures.ModelInternal.Operation.dotIsModelSaved(System.String)


Tekla.Structures.ModelInternal.Operation.ConstructMultiUserServerName(System.String)


Tekla.Structures.ModelInternal.Operation.dotConnectToNewMultiUserServerAndOpenModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotConvertAndOpenAsSingleUserModel(System.String)


Tekla.Structures.ModelInternal.Operation.dotConvertAndOpenAsMultiUserModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotConvertAndOpenAsMultiOrSingleUser(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotExcludeFromSharingAndOpen(System.String)


Tekla.Structures.ModelInternal.Operation.dotCreateNewSingleUserModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotCreateNewSingleUserModelFromTemplate(System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotCreateNewSharedModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotCreateNewMultiUserModel(System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSetUserModelRole(System.Guid,System.String,System.Guid,Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum)


Tekla.Structures.ModelInternal.Operation.dotSharingIsEnabled


Tekla.Structures.ModelInternal.Operation.dotModelImportIsEnabled


Tekla.Structures.ModelInternal.Operation.dotSharingLogPrint(Tekla.Structures.ModelInternal.Operation.DotSharingLogTypeEnum,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingRegisterPlugin(System.String,System.Boolean)


Tekla.Structures.ModelInternal.Operation.dotSharingCreateStartSharingBackup(System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingRestoreStartSharingBackup(System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingMakeModelShareable(System.String)


Tekla.Structures.ModelInternal.Operation.dotStartSharingCommit


Tekla.Structures.ModelInternal.Operation.dotSharingSaveVersionGuid(System.Guid,System.Int32,System.Collections.Generic.Dictionary{System.String,System.String})


Tekla.Structures.ModelInternal.Operation.dotSharingGetVersionGuid(System.Guid@)


Tekla.Structures.ModelInternal.Operation.dotSharingGetVersionPacket(System.Int32@)


Tekla.Structures.ModelInternal.Operation.dotSharingWriteOut(Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum,System.String,Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum,System.String,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@,System.Boolean@)
The dot sharing write out.
permission: User permission.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
mode: The write out mode.
revisionInfo:
The revision information as xml.
My comment
My code
myemail@tekla.com
My Name
errorCode: The Error Code in case the write-out failed.
errorDetail: Detail for the error
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
isRevertPossible: Performed model changes can be reverted without reopenign in case of failure.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.Operation.dotSharingWriteOutCommit(System.Boolean,System.Boolean,System.String,System.Int32,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)
The dot sharing write out commit.
success: True if write out was successful so commit to be done, if false uncommit to be done.
isRevertPossible: True if changes to database can be reverted in case of failure, false otherwise.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
packetNumber: The packet number.
errorCode: The Error Code in case the write-out failed.
errorDetail: Detail for the error
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
Returns: Commit/uncommit result.

Tekla.Structures.ModelInternal.Operation.dotSharingOpenModelForJoin(System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingJoinFinished


Tekla.Structures.ModelInternal.Operation.dotSharingReadInStarting(System.Boolean,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingReadIn(System.String,System.Int32,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)


Tekla.Structures.ModelInternal.Operation.dotSharingReadInCommit(System.Boolean,System.Boolean)


Tekla.Structures.ModelInternal.Operation.dotSharingShowReadInChanges


Tekla.Structures.ModelInternal.Operation.dotSharingCommandResult(System.Int32,System.Boolean,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingCreateNewModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingCreateEmptyModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingSetMenu(Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum)


Tekla.Structures.ModelInternal.Operation.dotModelSharingLicenseInfo(System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingCheckFileToReadIn(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingHistoryWriteLocal(System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingIsPrivilegesInpOwner
Check if user is privileges.inp owner.
Returns: True if user is privileges.inp owner.

Tekla.Structures.ModelInternal.Operation.dotSharingRestorePrivilegesInp
Restore privileges.inp file.

Tekla.Structures.ModelInternal.Operation.dotSharingGetModelLocalHistoryFolder(System.Int32,System.Boolean)
Get folder for model local history.

Tekla.Structures.ModelInternal.Operation.dotLoadModel2(System.String,System.String)
Load model2 from folder.
dotUnloadModel2 MUST be called to release.
folder: The model folder. The name of .db1 file must match folder name.
modelName: The model name (.db1, without extension). Can be empty if name is the same as folder name.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotLoadModel2FromLocalHistoryBySharingPacket(System.Int32)
Load model2 from local history, by sharing packet number.
dotUnloadModel2 MUST be called to release.
packetNumber: The sharing packet number (as it was before for the model before read in).
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotUnloadModel2
Unload model2 manager.

Tekla.Structures.ModelInternal.Operation.GetSharingLocalChangesAsync


Tekla.Structures.ModelInternal.Operation.InsertView(Tekla.Structures.Model.UI.View,System.Boolean,System.Boolean)


Tekla.Structures.ModelInternal.Operation.InsertViewByStandardFile(System.String,Tekla.Structures.Model.UI.View)


Tekla.Structures.ModelInternal.Operation.GetCurrentView
Returns the view over that the mouse was hovering last
Returns: Last hovered over view or null

Tekla.Structures.ModelInternal.Operation.GetViewRotationPointFromCurrentView(Tekla.Structures.Geometry3d.Point@)
Get view rotation point in global coordinates from current view.
viewPoint: The view rotation point.
Returns: True if current view and rotation point exists, otherwise false.

Tekla.Structures.ModelInternal.Operation.FetchModelObjects(System.Collections.Generic.List{System.String},System.Boolean)
Takes a guid list of object as input, checks if guid is native or external, and
instantiates and optionally selects objects before returning them.
guids: The GUID list to look for in the model.
SelectInstances: Optional parameter whether object is selected, default = true.
Returns: The model objects with the given guids,
skipping the objects which do not exists or object data loading failed for some reason.

Tekla.Structures.ModelInternal.Operation.FetchModelObjects(System.Collections.Generic.List{System.Int32},System.Boolean)
Takes a id list of objects as input, checks if guid is native or external, and
instantiates and optionally selects objects before returning them.
ids: The id list with integers to look for in the model.
SelectInstances: Optional parameter whether object is selected, default = true.
Returns: The valid model objects with the given ids and guids,
skipping the objects which do not exists or object data loading failed for some reason.

Tekla.Structures.ModelInternal.Operation.dotTranslateLabel(System.String)
Get translation in current language from loaded ail files.
label: The label.
Returns: The translation, if not found returns the label.

Tekla.Structures.ModelInternal.Operation.dotExportGetAttributeFiles(System.String)
Gets attribute files with specified suffix.
suffix: The filename suffix.
Returns: Attribute files found, or null if no files were found.

Tekla.Structures.ModelInternal.Operation.dotExportGetAttributeFilesWithPrefix(System.String,System.String)
Gets attribute files with specified prefix and suffix.
prefix: The filename prefix.
suffix: The filename suffix.
Returns: Attribute files found, or null if no files were found.

Tekla.Structures.ModelInternal.Operation.dotTryGetSubdirectoryFromFilePrefixAndSuffix(System.String,System.String,System.String@)
Searches for subdirectory for the file.
prefix: The filename prefix.
suffix: The filename suffix.
subdirectory: Returns the resolved subdirectory.
Returns: True if file is found, false otherwise.

Tekla.Structures.ModelInternal.Operation.dotTryGetSubdirectoryFromFileName(System.String,System.String@)
Searches for subdirectory for the file.
filename: The filename.
subdirectory: Returns the resolved subdirectory.
Returns: True if file is found, false otherwise.

Tekla.Structures.ModelInternal.Operation.dotExportSetAttributeFileSubdirectory(System.String,System.String)
Sets subdirectory for the file suffix.
suffix: The filename suffix.
subdirectory: The subdirectory of model folder where the file should be located.

Tekla.Structures.ModelInternal.Operation.dotExportClearAttributeFileCache
Clears cached file system for the subfolder "attributes" to take recent changes into account when files are requested next time.
Returns: True if operation is correct, false otherwise.

Tekla.Structures.ModelInternal.Operation.dotWriteToSessionLog(System.String)
Writes a message in the TeklaStructures Session Log file.
Message: Message to be written in Session Log.
Returns: True if operation is correct, false otherwise.
Throws System.ArgumentNullException: Message cannot be null.

Tekla.Structures.ModelInternal.Operation.dotWriteErrorToSessionLog(System.String)
Writes a message in the TeklaStructures Error Log file.
Message: Message to be written in Error Log.
Returns: True if operation is correct, false otherwise.
Throws System.ArgumentNullException: Message cannot be null.

Tekla.Structures.ModelInternal.Operation.dotExportShadowRegion(System.Collections.ArrayList)
Gets a Shadow (Projection) Area for list of parts.
PartIdentifiers: List of part's ids.
Returns: List of Shadow (Projection) areas for list of parts.
Throws System.ArgumentException: Too many parts in the list.

Tekla.Structures.ModelInternal.Operation.dotExportShadowRegionComplement(System.Collections.ArrayList)
Gets a Shadow Complement to the Extrma Area for list of parts.
PartIdentifiers: List of part's Identifiers.
Returns: List of Shadow Complement to the Extrma Area areas for list of parts.
Throws System.ArgumentException: Too many parts in the list.

Tekla.Structures.ModelInternal.Operation.dotDisplayComponentHelp(Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.Int32,System.String)


Tekla.Structures.ModelInternal.Operation.dotDisplayAutoDefaultSettings(Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.Int32,System.String)


Tekla.Structures.ModelInternal.Operation.dotStartCustomComponentCreation(System.String)


Tekla.Structures.ModelInternal.Operation.dotStartPluginCreation(System.String)


Tekla.Structures.ModelInternal.Operation.ComponentGetAppliedAttributes(Tekla.Structures.Model.BaseComponent)
Gets the applied attributes of given component type. Please note all hidden attributes are also returned.
baseComponent: The component type.
Returns: A dictionary of applied attribute names/values.

Tekla.Structures.ModelInternal.Operation.ComponentGetAppliedAttributes(Tekla.Structures.Model.BaseComponent,System.Boolean)
Gets the applied attributes of given component type. Please note all hidden attributes are also returned.
baseComponent: The component type.
ignoreDefaultValues: Defines if attributes with default values are also fetched.
Returns: A dictionary of applied attribute names/values.

Tekla.Structures.ModelInternal.Operation.ComponentSetAppliedAttributes(Tekla.Structures.Model.BaseComponent,System.Collections.Generic.Dictionary{System.String,System.Object}@)
Sets the applied attributes for a given component type.
baseComponent: The component type.
appliedAttributes: A dictionary of applied attribute names/values.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.ComponentSetAppliedAttributes(Tekla.Structures.Model.BaseComponent,System.Collections.Generic.Dictionary{System.String,System.Object}@,System.Boolean)
Sets the applied attributes for a given component type.
baseComponent: The component type.
appliedAttributes: A dictionary of applied attribute names/values.
addNewAttributes: Are new attributes registered to internal component data storage.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.ComponentDeleteAttributes(Tekla.Structures.Model.BaseComponent,System.Collections.Generic.List{System.String}@)
Delete the attributes for a given component type.
baseComponent: The component type.
attributeNames: A list of attribute names
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.ComponentGetAttributeFileExtension(Tekla.Structures.Model.BaseComponent)
Saves the applied attributes of given component type to file.
baseComponent: The component type.
Returns: Attribute file extension based on component type.

Tekla.Structures.ModelInternal.Operation.ComponentSaveAppliedAttributes(Tekla.Structures.Model.BaseComponent,System.String)
Saves the applied attributes of given component type to file.
baseComponent: The component type.
fileName: Name of the file.
Returns: A dictionary of applied attribute names/values.

Tekla.Structures.ModelInternal.Operation.ComponentApplyAndGetAttributesFromFile(Tekla.Structures.Model.BaseComponent,System.String,System.Boolean)
Read the attributes of given component type from file.
baseComponent: The component type.
fileName: Name of the file.
ignoreDefaultValues: Bool for ignoring default values from file .
Returns: A dictionary of applied attribute names/values.

Tekla.Structures.ModelInternal.Operation.dotExportGetColorRepresentationForObject(System.Int32,Tekla.Structures.Model.UI.Color@)
Gets the objects representation color seen currently on UI
ID: Object identifier, which color is fetched
color: Fetched color as return value
Returns: Color of the fectehd part, is successful
Throws System.ArgumentNullException: Thrown when a parameter is null.

Tekla.Structures.ModelInternal.Operation.GetTemporaryColor(System.Int32,Tekla.Structures.Model.UI.Color@)
Gets the objects representation color seen currently on UI
ID: Object identifier, which color is fetched
color: Fetched color as return value
Returns: Color of the fectehd part, is successful
Throws System.ArgumentNullException: Thrown when a parameter is null.

Tekla.Structures.ModelInternal.Operation.dotSetAdvancedOption(System.String,System.Boolean)
Sets boolean advanced option value.
VariableName: Name of the variable.
Value: if set to true [value].
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotSetAdvancedOption(System.String,System.Int32)
Sets integer advanced option value.
VariableName: Name of the variable.
Value: The value.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotSetAdvancedOption(System.String,System.String)
Sets string advanced option value.
VariableName: Name of the variable.
Value: The value.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotResetUserOptionToDefaultValue(System.String)
Resets advanced user option to its default value.
VariableName: Name of the user option.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotSetAdvancedOption(System.String,System.Double)
Sets double dvanced option.
VariableName: Name of the variable.
Value: The value.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.SetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t)
Sets the advanced option.
advancedOption: The advanced option.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotDaoFindObject(System.Int32,System.String,System.String,System.Int32)
Find akit object.
parentId: The parent ID (1 for root).
type: The type.
name: The name.
position: The position.
Returns: The object ID (0 if not found).

Tekla.Structures.ModelInternal.Operation.dotCleanDrawingFiles(System.Boolean,System.String)
Cleans drawing files.
Silent: Clean silenty. No confirmation dialogs shown.
BackupPath: Path to backup cleaned drawing files.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.dotGetFatherReferenceAssemblyId(System.Int32)
Gets reference objects parent reference assembly.
referenceObjectId: The unique identifier of the reference object to check.
Returns: Reference assembly id, 0 if not found. If reference object itself is top level assembly, it's own ID is returned.

Tekla.Structures.ModelInternal.Operation.dotGetCurrentModificationStampGuid
Gets the current modification stamp from the model, in form of Guid.
Returns: The current modification stamp Guid.

Tekla.Structures.ModelInternal.Operation.dotGetModifications(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.Boolean)
Get modifications by selected object types.
ModStamp: The modification stamp guid.
ObjectTypes: Types of object to select. Empty or null selects all types.
returnAlsoIfObjectIsCreatedAndDeletedAfterEvent: if set to true returns object as deleted also if object is created and deleted after event.
Returns:
All modifications compared to the modification stamp.

Tekla.Structures.ModelInternal.Operation.dotGetObjectsWithAnyModification(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Get objects with any modifications after the stamp by selected object types. Does not include deleted objects.
ModStamp: The modification stamp guid.
ObjectTypes: Types of object to select. Empty or null selects all types.
Returns:
Objects with any modifications after the stamp.

Tekla.Structures.ModelInternal.Operation.dotMarkObjectModifiedForOrganizer(System.Int32)
Mark object modfied with updating MOD_UDA_CHANGED without any other actions related to UDA insert/update.
objectId: The object id.
Returns:
True if successful.

Tekla.Structures.ModelInternal.Operation.dotGetMainPart(Tekla.Structures.Model.Assembly)
Returns the main part of the assembly or null if none. Does not select main part.
Returns: The main part of the assembly or null.

Tekla.Structures.ModelInternal.Operation.dotGetSubAssemblies(Tekla.Structures.Model.Assembly)
Selects and returns a list of subassemblies belonging to the assembly. Does not select subassemblies
Returns: A list of subassemblies.

Tekla.Structures.ModelInternal.Operation.dotGetAssemblyId(Tekla.Structures.Model.Assembly)
Returns the assembly identifier the assembly belongs to (null if none). Assembly must be selected before calling.
Returns: The assembly identifier or null.

Tekla.Structures.ModelInternal.Operation.dotGetSecondaries(Tekla.Structures.Model.Assembly)
Returns all the secondary assemblables belonging to the assembly.
Returns: An array list containing all the secondary assemblables belonging to the assembly.

Tekla.Structures.ModelInternal.Operation.GetObjectAssemblyPrimary(System.Int32)
Gets the object assembly's primary.
objectId: The object id.

Tekla.Structures.ModelInternal.Operation.dotGetDeletedObjecs(System.String,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.Boolean)
Gets a list of the objects that have been deleted after the modification stamp.
ModStamp: The modification stamp, as returned by GetCurrentModificationStampGuid().
ObjectTypes: Types of object to select. Empty or null selects all types.
returnAlsoIfObjectIsCreatedAndDeletedAfterEvent: if set to true returns also the objects that are both created and deleted after event.
Returns:
A list of the objects that have been deleted after the given modification stamp.

Tekla.Structures.ModelInternal.Operation.dotGetModificationsByFilter(System.String,System.String)
Get modifications by filter name.
ModStamp: The modification stamp guid.
FilterName: The filter name.
Returns: Modifications compared to the modification stamp by filter.

Tekla.Structures.ModelInternal.Operation.dotGetParentId(System.Int32,System.Int32@)
Get parent id according Organizer logic..
identifier: The object identifier.
rootAssemblyIdentifier: Returns root assembly identifier. 0 if object is root assembly.
Returns: Parent identifier id. 0 if object is root assembly.

Tekla.Structures.ModelInternal.Operation.dotChangeLegFaceLayer(System.Collections.Generic.List{System.Int32},System.Int32,System.Int32)
Applies the layer change to the legfaces of the rebar set.
legFaceIds: A list of ids of the leg faces.
rebarSetId: The id of the rebar set.
change: The change to apply
Returns: True if successful, false otherwise.

Tekla.Structures.ModelInternal.Operation.dotCheckModelOptionsModified(System.String)
Check if model options have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if model options have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckDrawingOptionsModified(System.String)
Check if drawing options have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if drawing options have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckMaterialDefinitionsModified(System.String)
Check if material definitions been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if material definitions have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckProfileDefinitionsModified(System.String)
Check if profile definitions been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if profile definitions have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckCustomPropertiesModified(System.String)
Check if any custom property plugins have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if custom property plugins have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckBoltDefinitionsModified(System.String)
Check if bolt definitions have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if bolt definitions have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckBoltAssemblyDefinitionsModified(System.String)
Check if bolt assembly definitions have been modified after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if bolt assembly definitions have been modified.

Tekla.Structures.ModelInternal.Operation.dotCheckDrawingsModified(System.String)
Check if any drawings have been created, modified or deleted after modification stamp.
ModStamp: The modification stamp guid.
Returns: True if drawings have been modified.returns>

Tekla.Structures.ModelInternal.Operation.dotCheckObjectModifiedAfterStamp(System.Guid,System.String)
Check if object has been modified after modification stamp.
objectGuid: The object unique identifier.
ModStamp: The mod stamp.
Returns: True if object has been modified after modification stamp.

Tekla.Structures.ModelInternal.Operation.CheckObject1ModifiedAfterObject2(Tekla.Structures.Model.ModelObject,Tekla.Structures.Model.ModelObject)
Check if object 1 has been modified after object 2.
object1: The object 1.
object2: The object 2 to check against to.
Returns: True if object1 has been modified after object2.

Tekla.Structures.ModelInternal.Operation.ObjectIncludedToCopyOrMoveOperation(Tekla.Structures.Identifier)
Check if model object is included in to the copy or move operation.
modelObjectIdentifier: The object identifier to be checked.
Returns: True if object is included to copy or move operation.

Tekla.Structures.ModelInternal.Operation.ObjectsIncludedToCopyOrMoveOperation
Check if model object is included in to the copy or move operation.
Returns: List of objects included to copy or move operation.

Tekla.Structures.ModelInternal.Operation.dotGetBeamPositioningBox(Tekla.Structures.Model.Beam)
Get the (section) box according to which beam positioning is done in non-middle positioning.
beam: The beam.
Returns: The (section) box according to which beam positioning is done. Null if fails.

Tekla.Structures.ModelInternal.Operation.dotGetObjectExtremaBoxData(System.Int32)
Retrieves the extrema box data for a specified object.
ObjectId: The identifier of the object.
Returns:
A tuple containing the coordinate system origin, X-axis vector, Y-axis vector, minimum point, and maximum point of the object's extrema box.
Returns null if the extrema box data cannot be retrieved.

Tekla.Structures.ModelInternal.Operation.dotShowPreviewDrawing(System.Int32)
dot Show This Preview Drawing
DrawingId: Id of the drawing

Tekla.Structures.ModelInternal.Operation.dotGetAllowedReferenceModelFileExtensions
Gets list of allowed reference model extensions.
Returns: The allowed extensions.

Tekla.Structures.ModelInternal.Operation.GetReferenceModelObjectFaces(Tekla.Structures.Identifier,System.Int32)
Gets the faces of the given reference model object.
referenceObjectIdentifier: The reference model object identifier.
maxFaceCount: Maximum face count. Use zero, for unlimited. If used and maximum reached, returns empty container.
Returns: The reference model object faces.

Tekla.Structures.ModelInternal.Operation.GetReferenceModelObjectFaces(Tekla.Structures.Identifier)
Gets the faces of the given reference model object.
referenceObjectIdentifier: The reference model object identifier.
Returns: The reference model object faces.

Tekla.Structures.ModelInternal.Operation.IsValidProfile(System.String)
Gets a value indicating whether the given profile is a valid profile.
profile: The profile to be checked.
Returns: True if a part can be created directly using that profile, otherwise false.

Tekla.Structures.ModelInternal.Operation.AllowAutoSave(System.Boolean)


Tekla.Structures.ModelInternal.Operation.ImportBuildingHierarchyDataFromReferenceModel(System.String,System.Int32,System.Boolean)
Imports the given reference models building hierarchy data. If reference model file is provided, gets
data from the file. If reference model id is given, the data is retrieved from that, and file is then ignored.
referenceModelFile: The reference model (TrimBIM) file name and path.
referenceModelId: The reference model id.
includeSpaces: True if spaces should be included in the import, False otherwise.
Returns: True if anything imported from reference model, otherwise false.

Tekla.Structures.ModelInternal.Operation.AbsoluteFilePath(System.String,Tekla.Structures.ModelInternal.Operation.MacroLocationEnum)
The file path.
fileName:
The file name.
macroLocation:
The macro Location.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.Operation.GetLocalAndGlobalMacroDirectories(System.String,Tekla.Structures.ModelInternal.Operation.MacroLocationEnum)
The get local and global macro directories.
fileName:
The file Name.
macroLocation:
The macro Location.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.Operation.DirectoryExists(System.String,Tekla.Structures.ModelInternal.Operation.MacroLocationEnum)
The file exists.
fileName:
The file name.
macroLocation:
The macro Location.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.Operation.CreateDstvStructure(Tekla.Structures.Identifier,System.String,Tekla.Structures.ModelInternal.Dstv.DstvStructure@,System.Boolean,System.String,System.Boolean,System.String)
Creates NC structure from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
PartID: The identifier of the part.
NCFileSettings: The name of the NC setting template to be used in creation.
CreatePopMarks: Create pop-marks during export.
PopMarkSettingsFileName: The name of the pop-mark setting file to be used in creation.
CreateContourMarking: Create contour marking during export.
ContourMarkingSettingsFileName: The name of the contour marking setting file to be used in creation.
DstvOutput: The DSTV output as structure.
Returns: True if the NC structure is created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.ModelInternal;
using Tekla.Structures.ModelInternal.Dstv;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create NC for") as Beam;
Identifier BeamId = Beam1.Identifier;
DstvStructure DstvOutput;
if (Operation.CreateDstvStructure(BeamId, "DSTV for profiles", out DstvOutput, true, "standard", true, "standard"))
{
//modify the dstv structure
DstvOutput.WriteOutput();
}
}
catch { }
}
}

Tekla.Structures.ModelInternal.Operation.SwapLine(Tekla.Structures.Geometry3d.LineSegment)
Swaps a line
line: Line to swap
Returns: The swapped line

Tekla.Structures.ModelInternal.Operation.SwapArc(Tekla.Structures.Geometry3d.Arc)
Swaps an arc
arc: Arc to swap
Returns: The swapped arc

Tekla.Structures.ModelInternal.Operation.SwapPolycurve(Tekla.Structures.Geometry3d.Polycurve)
Swaps a polycurve
polycurve: Polycurve to swap
Returns: The swapped polycurve

Tekla.Structures.ModelInternal.Operation.SwapConstructionObjectOrder(Tekla.Structures.Model.ModelObject)
Swaps the order of a construction object
modelObject: Construction object
Returns: True if successful, false otherwise

Tekla.Structures.ModelInternal.Operation.ValidateLoftedPlateBaseCurves(System.Collections.Generic.List{Tekla.Structures.Geometry3d.ICurve})
Validates a set of base curves for a lofted plate
baseCurves: Lofted plate base curves
Returns: Validation result

Tekla.Structures.ModelInternal.Operation.GetBoltedPartsHoleElevations(Tekla.Structures.Model.BoltGroup)
Gets the bolt group parts hole elevations
boltGroup: The bolt group
Returns: The holes elevations

Tekla.Structures.ModelInternal.Operation.FlipBoltGroupDirection(Tekla.Structures.Model.BoltGroup)
Flip bolt group direction
boltGroup: The bolt group

Tekla.Structures.ModelInternal.Operation.HighlightBoltedParts(System.Int32)
Highlights parts connected by the bolt group.
boltID: The ID of the bolt group.
Returns: True if the appending operation was successful.

Tekla.Structures.ModelInternal.Operation.InsertSplitBolt(Tekla.Structures.Model.BoltGroup)
Inserts a bolt group that can be split.
boltGroup: The inserted bolt group.
Returns: True if insert was successful.

Tekla.Structures.ModelInternal.Operation.HighlightConnectedObjects(System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject})
Highlight the list of picked objects.
Only the list of objects will be highlighted and have the status of the selected objects.
ModelObjects: The IEnumerable of model objects to highlight.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.UnhighlightConnectedObjects
Highlight the list of picked objects.
Only the list of objects will be highlighted and have the status of the selected objects.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.GetSimilarNumberedObjectsCoordinateSystems(Tekla.Structures.Identifier,Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.CoordinateSystem@,Tekla.Structures.Geometry3d.CoordinateSystem@)
Get similar numbered objects coordinate systems
object1Id: The first object ID.
object2Id: The second object ID.
cs1: The coordinate system of the first object.
cs2: The coordinate system of the second object.
Returns: True if successful.
Remarks: The IDs must be either both assembly, or both part identifiers.

Tekla.Structures.ModelInternal.Operation.AppendShapeMetadata(System.String,System.Collections.Generic.List{System.String})
Append the metadata defined in keyValStrings to shape identified by guid
NOTE: Expected order of strings in the keyValStrings is:
key, value, value type, label, description
guid: The guid of the shape
keyValStrings: The key value pairs of strings that contain the metadata
Returns: True if the appending operation was successful

Tekla.Structures.ModelInternal.Operation.AddShapeMetadataKeyVal(System.String,System.String,System.Collections.Generic.List{System.String})
Add key-value fields to Shape Metadata.
shapeGuid: This defines the unique GUID of the shape whose Metadata will be manipulated
key: A string that defines the key in the Metadata key-value pair
value: List of value fields for the key. Can be empty, but must not be null
Value fields are in order: value, type, label, description.///
Returns: ShapeMetadataResult.OK if operation was successful. For more information Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult

Tekla.Structures.ModelInternal.Operation.UpdateShapeMetadata(System.String,System.String,System.Collections.Generic.List{System.String})
Updates the value of an existing key in the shape metadata
shapeGuid: This defines the unique GUID of the shape whose Metadata will be manipulated
key: Defines the existing metadata key to search for in the shape
newValue: The new value to set for key///
Returns: ShapeMetadataResult.OK if operation was successful. For more information Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult

Tekla.Structures.ModelInternal.Operation.GetShapeMetadataVal(System.String,System.String)
Get metadata value associated with the input key
key: Metadata key
guid: The guid of the shape
Returns: A string that contains the value for the specified key

Tekla.Structures.ModelInternal.Operation.GetShapeAllMetadataKeys(System.String)
Gets all metadata keys associated with the shape
guid: The guid of the shape
Returns: A list of strings containing the keys

Tekla.Structures.ModelInternal.Operation.DeleteShapeMetadata(System.String,System.String)
Delete the metadata by key
guid: The guid of the shape
metaDataKey: The meta data key
Returns:

Tekla.Structures.ModelInternal.Operation.GetShapeStructuredMetadata(System.String)
Get metadata from the shape catalog for a shape specified by its GUID
guid: The guid of the shape
Returns: List of tuples that contain keys and corresponding value list containing the metadata

Tekla.Structures.ModelInternal.Operation.SetPrintingController(Tekla.Structures.ModelInternal.IPrintingController)
Set printing controller object on the TS side.
PrintingController: The printing controller.
Returns: True if successful.

Tekla.Structures.ModelInternal.Operation.GetPrintingController
Get printing controller object on the TS side.
Returns: The printing controller.

Tekla.Structures.ModelInternal.Operation.EnableFilteringCache
Enable caching of filters from files.

Tekla.Structures.ModelInternal.Operation.DisableFilteringCache
Disable caching of filters from files.

Tekla.Structures.ModelInternal.Operation.ObjectsMatchToFilter(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.String)
Checks whether the objects are matching to the criteria in the given filter.
modelObjects: The model objects to check.
filterName: The filter file to check against.
Returns: The objects matching to the given filter criteria.

Tekla.Structures.ModelInternal.Operation.ObjectsMatchToFilter(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Filtering.FilterExpression)
Checks whether the objects are matching to the criteria in the given filter.
modelObjects: The model objects to check.
filterExpression: The filter expression to check against.
Returns: The objects matching to the given filter criteria.

Tekla.Structures.ModelInternal.Operation.GetAttribute(System.Int32,System.String)
Gets the attribute value of the given object.
objectId: The object id.
attributeName: The attribute to be fetched.
Returns: The objects property.

Tekla.Structures.ModelInternal.Operation.GetAvailableCustomPropertyNames
Gets the available custom property ("CUSTOM.[property name]" names currently supported by loaded custom property plugins.
Returns: The available custom property names.

Tekla.Structures.ModelInternal.Operation.GetRebarShapeRecognitionData(Tekla.Structures.Identifier,System.Int32,Tekla.Structures.ModelInternal.RebarShapeRecognitionData@)
Gets the rebar shape recognition data required by certain Construsoft plugins.
rebarId: The rebar ID.
barIndex: For rebar groups, the index (0-based) of the bar required; otherwise 0.
data: The rebar shape recognition data.
Returns: True if successful; otherwise false.

Tekla.Structures.ModelInternal.Operation.GetVirtualBarIdentifiersByGuid(System.String)
Gets the identifiers of the virtual bars associated with a GUID.
guid: A virtual bar GUID, or a virtual bar group GUID, or a rebar set GUID.
Returns: The virtual bar identifiers.

Tekla.Structures.ModelInternal.Operation.AutomatedTesting_BroadcastMessage(System.String)
Broadcasts a test message to TS core for automated testing purposes.
testMessage: The message to be broadcasted.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.Operation.WriteTrbCreatedEvent
Writes a TrbCreated event to the dbvirtual

Tekla.Structures.ModelInternal.Operation.StartLiveSharing(Tekla.Structures.Model.Internal.LiveSharingChangeSetDelegate,System.Guid,Tekla.Structures.Model.Internal.LiveSharingModelType,Tekla.Structures.Identifier)
Start LiveSharing and return changesets via callback
callback: The callback used for increments/change sets
callbackGuid: The callback Guid used to register the callback
modelType: The model type
viewId: The view id
Returns: True if successful

Tekla.Structures.ModelInternal.Operation.StopLiveSharing(System.Guid)
Stop LiveSharing
Returns:

Tekla.Structures.ModelInternal.Operation.RegisterExcelDialogOpeningCallback(Tekla.Structures.Model.Internal.ReportingExcelDialogDelegate)
Registers a callback for opening the Excel report dialog.
reportingExcelDialogCallback:
Returns: true, always

Tekla.Structures.ModelInternal.Operation.CreateBaseline(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,Tekla.Structures.Identifier,Tekla.Structures.Model.Internal.CancellableProgressReportDelegate)
Create a new baseline
trimbimFilePath:
modelType:
viewId:
progressCb: Callback to update the progress and get cancelation notification.
Returns: true if the baseline is created, false otherwise

Tekla.Structures.ModelInternal.Operation.AddChangeSet(System.String,System.String,System.Byte[])
Adds the change set, adjusts the base model to the changes
changeSetName: The change set name
baseModelPath: The base model path
trimbimBlob: The TrimBim blob
Returns: True if the change set is added successfully, false otherwise

Tekla.Structures.ModelInternal.Operation.RemoveChangeSet(System.String)
Removes the change set
baseModelPath: The overlay model path
Returns: True if the change set is removed successfully, false otherwise

Tekla.Structures.ModelInternal.Operation.GetPendingChangeSets(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,Tekla.Structures.Identifier)
Gets the initial change set that includes all changes prior joining a session
eventName:
modelType:
viewId:
Returns: the initial change set

Tekla.Structures.ModelInternal.Operation.GetEventTimeGuid(System.String)
Gets the time Guid from the latest Connect Upload event
Returns: The time Guid of the Connect Upload event

Tekla.Structures.ModelInternal.Operation.EventsDbTimeOrdered(System.String,System.String)
Checks if the provided event time guids are ordered correctly
Returns: true if the events are ordered, false otherwise

Tekla.Structures.ModelInternal.Operation.WriteEventToDatabase(System.String)
Writes an event to the database
Returns: true

Tekla.Structures.ModelInternal.Operation.RenameEvent(System.String,System.String)
Renames an existing event
Returns: true if the renaming succeeds, false otherwise

Tekla.Structures.ModelInternal.Operation.RegisterAssertCallback(Tekla.Structures.Model.Internal.AssertEventDelegate)
Registers the assert callback
callback: The callback
Returns: True if successful

Tekla.Structures.ModelInternal.Operation.FlipBoltDistanceInY(Tekla.Structures.Model.BoltGroup)
Flip bolt distance in Y
boltGroup: The bolt group

Tekla.Structures.ModelInternal.Operation.GetBoltedPartsNumber(Tekla.Structures.Model.BoltGroup)
Get bolted parts number
boltGroup: The bolt group

Tekla.Structures.ModelInternal.Operation.FlipHoles(Tekla.Structures.Model.BoltGroup)
Flip bolt holes
boltGroup: The bolt group

Tekla.Structures.ModelInternal.Operation.GetTSLanguageCultureString
Get the Tekla Structures culture language format (ex:en-US).
Returns:

Tekla.Structures.ModelInternal.Operation.GetAvailableProfiles
Gets the available profiles by category to profiles and their materials.
Returns: The available profiles.

Tekla.Structures.ModelInternal.Operation.GetAvailableMaterials(System.String)
Gets the available materials for profile.
profileName: The profile, for which materials are fetched.
Returns: The available materials.

Tekla.Structures.ModelInternal.Operation.GetNumberingTemporaryRecordList
Get a list of numbering temporary records in byte[] format for protobuf usage.
Returns: byte array

Tekla.Structures.ModelInternal.Operation.ShowAssembliesHierarchy(System.Collections.Generic.List{System.Int32})
Show assemblies hierarchy.
selectedAssemblies:
Returns:

Tekla.Structures.ModelInternal.Operation.GetMousePositionInModelCoordinates
Gets the mouse position in model coordinates.
Returns: The picked model position if it is successfully, null otherwise

Tekla.Structures.ModelInternal.Operation.GetNumberingSettings(Tekla.Structures.ModelInternal.dotNumberingSettingsType_t@)
Get the numbering settings.
This function is only accessible if the numbering state is completed. Otherwise, it will return false and the numbering settings will not be fetched.
pNumberingSettings: The numbering settings.
Returns: True if the numbering settings were successfully fetched.

Tekla.Structures.ModelInternal.Operation.CheckABMNumbering(System.Collections.Generic.List{Tekla.Structures.ModelInternal.CheckResult}@)
Calls the check in the ABM numbering.
checkResults: The results of the check ABM call.
Returns: True if the check in the ABM numbering was successful.

Tekla.Structures.ModelInternal.Operation.GetDeletedSubmittedPartsCount(System.String)
Retrieves the number of deleted parts that were previously submitted to procurement.

Tekla.Structures.ModelInternal.Operation.ProcessABMNumbering(System.Collections.Generic.List{System.Int32})
Calls the processing functionality in the ABM numbering.
selectedModelObjects: List of objects to be processed.
Returns: True if the process in the ABM numbering was successful.

Tekla.Structures.ModelInternal.Operation.UnnumberProcurementParts(System.Collections.Generic.List{System.Int32})
Unassign numbers in the procurement numbering.
selectedModelObjects: List of objects to be processed.
Returns: True if at least one part was unnumbered, false otherwise.

Tekla.Structures.ModelInternal.Operation.SendCustomPartsToABMNumbering(System.Collections.Generic.List{System.Int32},System.String,System.String@,System.String@)
Calls the send functionality in the ABM numbering by giving a list of custom parts ids.
partIds: The parts to be sent.
propertiesPath: The property set file path.
changesFilePath: The path to the changes trim bim file.
allHistoryFilePath: The path to the all history trim bim file.
Returns: True if the send in the ABM numbering was successful.

Tekla.Structures.ModelInternal.Operation.GetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)
Calls the get settings functionality in the ABM numbering.
Returns: true if successful

Tekla.Structures.ModelInternal.Operation.SetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)
Calls the set settings functionality in the ABM numbering.
Returns: true if successful

Tekla.Structures.ModelInternal.Operation.ClearOldFabricatorSettings
Clears stored fabricator settings. This should be called when fabricator settings change.

Tekla.Structures.ModelInternal.Operation.GetNormalizedPlateProfileName(System.Int32,System.Int32)
Gets parts normalized plate profile name (PL20X10 -> PL10X20).
objectId: The parts id.
numOfDimensions: Number of dimension in the normalized plate proifle name (PL10, PL10X20)
Returns: normalized plate profile name if part was plate and null otherwise

Tekla.Structures.ModelInternal.Operation.IsValidFabricatorProfile(System.String)
Check if profile is according to fabricator settings.

Tekla.Structures.ModelInternal.Operation.IsValidFabricatorMaterial(System.String,System.String)
Check if material is according to fabricator settings.

Tekla.Structures.ModelInternal.Operation.IsValidFabricatorFinish(System.String)
Check if finish is according to fabricator settings.

Tekla.Structures.ModelInternal.Operation.IsProfileAccepted(System.String)
Check if detailer has accepted a profile that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.IsMaterialAccepted(System.String,System.String)
Check if detailer has accepted a material that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.IsFinishAccepted(System.String)
Check if detailer has accepted a finish that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.AddAcceptedProfile(System.String)
Accept profile that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.AddAcceptedMaterial(System.String,System.String)
Accept material that is against fabricator settings
.

Tekla.Structures.ModelInternal.Operation.AddAcceptedFinish(System.String)
Accept finish that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.DeleteAcceptedProfile(System.String)
Unaccept profile that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.DeleteAcceptedMaterial(System.String,System.String)
Unaccept material that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.DeleteAcceptedFinish(System.String)
Unaccept finish that is against fabricator settings.

Tekla.Structures.ModelInternal.Operation.RunNumberingCommandWithPreview(System.Boolean,System.Boolean)
Execute the numbering command with preview functionality.
NumberSelectedSeries: To run numbering for selected series or all modified objects.
IsFullNumbering: To run full/repair numbering or only for modified objects.
Returns: true if executing, false if requiring either accept or reject of previous numbering command.

Tekla.Structures.ModelInternal.Operation.AcceptNumberingResults
Accept the numbering results.
Returns: True if ok to accept, false if numbering was not run before this.

Tekla.Structures.ModelInternal.Operation.RejectNumberingResults
Reject the numbering results (cancel previous executed numbering).
Returns: True if ok to cancel, false if numbering was not run before this.

Tekla.Structures.ModelInternal.Operation.ClearVirtualBarCache
Clear all virtual rebar cache.

Tekla.Structures.ModelInternal.Operation.TestSharingOperationAsync(System.Boolean)
A testing sharing operation. Does not do anything usefult but allows testing API integration.
showProgressDialog: If true, TS would show modal progress dialog, blocking UI interaction.
Returns: Awaitable task.